{"keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 20000, "embeddings_regularizer": null, "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "name": "embedding_1", "mask_zero": false, "batch_input_shape": [null, null], "dtype": "int32", "activity_regularizer": null, "output_dim": 128, "input_length": null, "embeddings_constraint": null}}, {"class_name": "LSTM", "config": {"unroll": false, "return_state": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "units": 50, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "implementation": 0, "trainable": true, "bias_regularizer": null, "go_backwards": false, "name": "lstm_1", "return_sequences": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "recurrent_dropout": 0.5, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "dropout": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax", "units": 2, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}